using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

// 有关程序集的常规信息通过下列属性集
// 控制。更改这些属性值可修改
// 与程序集关联的信息。
[assembly: AssemblyTitle("FrameWorks")]
[assembly: AssemblyDescription("联迪自助应用程序框架")]
[assembly: AssemblyConfiguration("")]
[assembly: AssemblyCompany("LandiCorp")]
[assembly: AssemblyProduct("FrameWorks")]
[assembly: AssemblyCopyright("版权所有 (C) LandiCorp 2014")]
[assembly: AssemblyTrademark("")]
[assembly: AssemblyCulture("")]

// 将 ComVisible 设置为 false 使此程序集中的类型
// 对 COM 组件不可见。如果需要从 COM 访问此程序集中的类型，
// 则将该类型上的 ComVisible 属性设置为 true。
[assembly: ComVisible(false)]

// 如果此项目向 COM 公开，则下列 GUID 用于类型库的 ID
[assembly: Guid("12f6b30c-42af-4bbf-9f8f-52df3ca3121c")]

// 程序集的版本信息由下面四个值组成:
//
//      主版本
//      次版本 
//      内部版本号
//      修订号
//
// 可以指定所有这些值，也可以使用“修订号”和“内部版本号”的默认值，
// 方法是按如下所示使用“*”:
[assembly: AssemblyVersion("2.3.9.0")]
[assembly: AssemblyFileVersion("2.3.9.0")]
[assembly: log4net.Config.XmlConfigurator(ConfigFile = "log4net.config", Watch = true)]
/************************************************************************/
/* 版本修订记录                                                         */
/************************************************************************/
//2014-10-29 ver:2.0 lanpp
//BusinessStratagy 增加抽象方法，用于清除数据，不具有向下兼容
//在解包的时候，为了防止解包异常失败，抓取异常，设置校验码错误，支付需要发冲正包
/************************************************************************/
//2014-10-30 ver:2.1 lanpp
//增加实体基类BaseEntity，用于交易过程中使用
//增加BusinessStratagy BaseEntity属性 用于Activity子类实体
/************************************************************************/
//2014-11-15 ver:2.2 lanpp
//修改GPRS，获取多个应用IP和端口
/************************************************************************/
//2014-11-24 ver:2.3 lanpp
//增加BaseEntity，对于是否启用IC卡和初始化是否下载IC参数的标志
/************************************************************************/
//2014-12-11 ver:2.3.1 lanpp
//修改EMV，增加对R80的操作
/************************************************************************/
//2015-1-14 ver:2.3.2 lanpp
//修改打印机开始打印位置函数
/************************************************************************/
//2015-2-2 ver:2.3.3 lanpp
//修改数字输入，max的时候不能退格
/************************************************************************/
//2015-2-2 ver:2.3.4 lanpp
//增加key的上下翻页、重试等键盘按钮
//修改插入银行卡不管是否是IC卡类似，都尝试上电判断
/************************************************************************/
//2015-2-2 ver:2.3.4 lanpp
//修改之前IC卡处理，不管IC卡不规范可能导致降级处理（45错误）
/************************************************************************/
//2015-2-2 ver:2.3.5 lanpp
//增加EventHandler，用于委托在自定义方法中运行，与业务无关
/************************************************************************/
//2015-3-24 ver:2.3.6 lanpp
//添加自动注册msxml4
/************************************************************************/
//2015-3-24 ver:2.3.7 lanpp
//增加baseEntity 处理针对业务的错误码解析方法
/************************************************************************/
//2015-5-27 ver:2.3.8 lanpp
//增加全局变量，应用初安装AppFirst
/************************************************************************/
//2015-5-27 ver:2.3.9 lanpp
//增加全局变量，Eudemon开关
/************************************************************************/